# 1. ვიქტორინა
# შეადგინე ვიქტორინის პროგრამა. მომხმარებელს უნდა დავუსვათ კითხვა: “რომელი
# იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს
# დღესაც?”
# სავარაუდო პასუხები:
# 1. შუმერთა
# 2. სელჩუკთა
# 3. რომის
# 4. მონღოლთა
# მომხმარებელმა უნდა შეიყვანოს სწორი პასუხის ნომერი ან თავად სწორი პასუხი.
# შეცდომის შემთხვევაში იბეჭდება:
# „არა! სწორი პასუხია რომის!“
# სწორი პასუხის შემთხვევაში იბეჭდება:
# „სწორია!“

question = "რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?"
answer = input(""" {}
               1.შუმერთა 
               2.სელჩუკთა 
               3. რომის 
               4. მონღოლთა 
               """.format(question)

               ).lower()
if answer == "3" or answer == "რომის" or answer == "romis":
    print("სწორია!")
else:
    print("არა! სწორი პასუხია რომის!")

# 2. გამრავლების ტაბულა
# ორმაგი for ციკლის_ის დახმარებით დაბეჭდე გამრავლების ტაბულა 1_დან
# მომხმარებლის მიერ შეყვანილი მთელი რიცხვის ჩათვლით.

num1 = int(input("Enter Number... "))

for i in range(1, (num1 + 1)):
    print("")
    for j in range(1, (num1 + 1)):
        print(f"{i} * {j} = ", i * j)

# 3. თუთიყუშის პროგრამა
# დაწერე პროგრამა _ თუთიყუში. პროგრამამ უნდა გაიმეოროს რასაც ეტყვი მანამ სანამ არ
# შეიყვან სიტყვას quit, თუმცა წინ დაურთოს კითხვა „User Said Whaaat!?”
# თუ შევიყვანეთ სიტყვა Hello დაიბეჭდება
# „User Said Whaaat!?”
# “User Said Hello”

while True:
    word = input("User Said Whaaaat?!")
    if word == "quit":
        break
    else:
        print(f"User Said Whaaaat?!\nUser Said {word}")

